[
  {
    "name": "spidermanpub",
    "stats": {
      "personality": "cocky",
      "richness": "poor"
    },
    "responses": {
      "offers": [
        "I'll sling my way over there now!",
        "You're a bit far away, I guess I could help...",
        "By the power of Uncle Ben I shall help you!",
        "My spidey sense is tingling, in all the right places. How can I help?"
      ],
      "rejections": [
        "No fucking way mate!",
        "You're having a bubble",
        "You can't be serious..."
      ],
      "insults": {
        "generic": [
          "I'll cover you in sweet web you idiot!",
          "Lick my spinneret 😂",
          "Wow, you're old.",
          "You're just a fly to me"
        ],
        "batman": [
          "Both your parents are dead, but at least I'm not a douche!",
          "Hey bat-douche, how's life living with an old man?",
          "Wow bruce mate... you surprise me every time with your stupidity.😂"
        ],
        "deadpool": [
          "You're a right dickhead mate!"
        ]
      }
    }
  },
  {
    "name": "batmanpub",
    "stats": {
      "personality": "badass",
      "richness": "massive"
    },
    "responses": {
      "offers": [
        "Wheres the Bat beacon?! On my way anyway.",
        "I don't really do work for less than half a million",
        "Alfred, sort get ready to rock 'n roll",
        "My parents might be dead, but my spirit is strong!"
      ],
      "rejections": [
        "Seriously? You're really pushing it. Call @superman, he does shitty small jobs like that.",
        "I need more dollar for my next film I guess, actually on second thoughts, no.",
        "Ben Affle... I mean Batman is on his way (oops). You may die, sorry."
      ],
      "insults": {
        "generic": [
          "You're so poor you really need the work",
          "I may not have any superpowers, but yours are shit. Do one.",
          "My batarang will end you, idiot."
        ],
        "spiderman": [
          "Why don't you get your uncle to make you some rich TROLOLOLO 😂👍🏿"
        ],
        "superman": [
          "You're trash, Clarke"
        ]
      }
    }
  },
  {
    "name": "supermanpub",
    "stats": {
      "personality": "nerdy journalist",
      "richness": "minimum wage"
    },
    "responses": {
      "offers": [
        "Wheres the Bat beacon! On my way anyway.",
        "I don't really do work for less than half a million",
        "Lois will think I'm really hot after this... Don't move - on my way!!",
        "Journalism is challenging, but not as much as saving people from contrived and unrealistic situations - OMW!"
      ],
      "rejections": [
        "You're not worth my time. Sorry."
      ],
      "insults": {
        "generic": [
          "I beat Lex Luthor mate, come at me bro!",
          "Kryptonite ain't shit",
          "This is the thing, you're a crap superhero"
        ],
        "deadpool": [
          "They'll find you dead in the alleyway, with cats lickin' at ya!",
          "Try being me for a day, betcha can't handle it"
        ],
        "batman": [
          "You smell like the city dump",
          "You wish you could fly like me"
        ]
      }
    }
  }
]
